lyz1202dt/2026diansai/empty.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.10.00.04"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.10.00.04"
 * @versions {"tool":"1.27.1+4634"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const Board         = scripting.addModule("/ti/driverlib/Board");
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const I2C           = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1          = I2C.addInstance();
const I2C2          = I2C.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const PWM2          = PWM.addInstance();
const SPI           = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1          = SPI.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const UART3         = UART.addInstance();
const UART4         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
ADC121.$name               = "ADC12_0";
ADC121.enableDMA           = false;
ADC121.sampClkSrc          = "DL_ADC12_CLOCK_ULPCLK";
ADC121.enabledInterrupts   = ["DL_ADC12_INTERRUPT_MEM0_RESULT_LOADED"];
ADC121.adcMem1chansel      = "DL_ADC12_INPUT_CHAN_1";
ADC121.sampClkDiv          = "DL_ADC12_CLOCK_DIVIDE_8";
ADC121.adcMem2chansel      = "DL_ADC12_INPUT_CHAN_5";
ADC121.adcMem0chansel      = "DL_ADC12_INPUT_CHAN_5";
ADC121.sampleTime0         = "125us";
ADC121.peripheral.$assign  = "ADC1";
ADC121.adcPin5Config.$name = "ti_driverlib_gpio_GPIOPinGeneric14";

Board.peripheral.swdioPin.$assign = "PA19";

GPIO1.port                    = "PORTA";
GPIO1.portSegment             = "Lower";
GPIO1.$name                   = "LED";
GPIO1.associatedPins[0].$name = "LED0_PIN";

GPIO2.$name                                       = "LED_RGB";
GPIO2.port                                        = "PORTB";
GPIO2.portSegment                                 = "Upper";
GPIO2.associatedPins.create(3);
GPIO2.associatedPins[0].$name                     = "LED_R";
GPIO2.associatedPins[0].pin.$assignAllowConflicts = "PB26";
GPIO2.associatedPins[1].$name                     = "LED_G";
GPIO2.associatedPins[1].pin.$assign               = "PB27";
GPIO2.associatedPins[2].$name                     = "LED_B";
GPIO2.associatedPins[2].pin.$assignAllowConflicts = "PB22";

GPIO3.$name                         = "BEEP";
GPIO3.port                          = "PORTA";
GPIO3.portSegment                   = "Upper";
GPIO3.associatedPins[0].$name       = "BEEP_PIN";
GPIO3.associatedPins[0].pin.$assign = "PA27";

GPIO4.$name                              = "KEY3";
GPIO4.port                               = "PORTB";
GPIO4.associatedPins.create(3);
GPIO4.associatedPins[0].$name            = "K1";
GPIO4.associatedPins[0].direction        = "INPUT";
GPIO4.associatedPins[0].ioStructure      = "SD";
GPIO4.associatedPins[0].internalResistor = "PULL_UP";
GPIO4.associatedPins[0].pin.$assign      = "PB21";
GPIO4.associatedPins[1].$name            = "K2";
GPIO4.associatedPins[1].direction        = "INPUT";
GPIO4.associatedPins[1].ioStructure      = "SD";
GPIO4.associatedPins[1].internalResistor = "PULL_UP";
GPIO4.associatedPins[1].pin.$assign      = "PB23";
GPIO4.associatedPins[2].$name            = "K3";
GPIO4.associatedPins[2].direction        = "INPUT";
GPIO4.associatedPins[2].ioStructure      = "SD";
GPIO4.associatedPins[2].internalResistor = "PULL_UP";
GPIO4.associatedPins[2].pin.$assign      = "PB24";

GPIO5.$name                                       = "KEY5";
GPIO5.associatedPins.create(5);
GPIO5.associatedPins[0].direction                 = "INPUT";
GPIO5.associatedPins[0].ioStructure               = "SD";
GPIO5.associatedPins[0].$name                     = "K_UP";
GPIO5.associatedPins[0].pin.$assign               = "PB12";
GPIO5.associatedPins[1].$name                     = "K_DOWN";
GPIO5.associatedPins[1].direction                 = "INPUT";
GPIO5.associatedPins[1].ioStructure               = "SD";
GPIO5.associatedPins[1].pin.$assign               = "PB8";
GPIO5.associatedPins[2].$name                     = "K_LEFT";
GPIO5.associatedPins[2].direction                 = "INPUT";
GPIO5.associatedPins[2].ioStructure               = "SD";
GPIO5.associatedPins[2].pin.$assign               = "PB9";
GPIO5.associatedPins[3].$name                     = "K_RIGHT";
GPIO5.associatedPins[3].direction                 = "INPUT";
GPIO5.associatedPins[3].ioStructure               = "SD";
GPIO5.associatedPins[3].pin.$assign               = "PB10";
GPIO5.associatedPins[4].$name                     = "K_MAIN";
GPIO5.associatedPins[4].direction                 = "INPUT";
GPIO5.associatedPins[4].ioStructure               = "SD";
GPIO5.associatedPins[4].pin.$assignAllowConflicts = "PB11";

GPIO6.$name                         = "ENCODER_PIN";
GPIO6.associatedPins.create(4);
GPIO6.associatedPins[0].$name       = "E1A";
GPIO6.associatedPins[0].direction   = "INPUT";
GPIO6.associatedPins[0].interruptEn = true;
GPIO6.associatedPins[0].polarity    = "RISE_FALL";
GPIO6.associatedPins[0].ioStructure = "SD";
GPIO6.associatedPins[0].pin.$assign = "PB3";
GPIO6.associatedPins[1].$name       = "E1B";
GPIO6.associatedPins[1].direction   = "INPUT";
GPIO6.associatedPins[1].interruptEn = true;
GPIO6.associatedPins[1].polarity    = "RISE_FALL";
GPIO6.associatedPins[1].ioStructure = "SD";
GPIO6.associatedPins[1].pin.$assign = "PB2";
GPIO6.associatedPins[2].$name       = "E2A";
GPIO6.associatedPins[2].direction   = "INPUT";
GPIO6.associatedPins[2].interruptEn = true;
GPIO6.associatedPins[2].polarity    = "RISE_FALL";
GPIO6.associatedPins[2].ioStructure = "SD";
GPIO6.associatedPins[2].pin.$assign = "PA7";
GPIO6.associatedPins[3].$name       = "E2B";
GPIO6.associatedPins[3].direction   = "INPUT";
GPIO6.associatedPins[3].interruptEn = true;
GPIO6.associatedPins[3].polarity    = "RISE_FALL";
GPIO6.associatedPins[3].ioStructure = "SD";
GPIO6.associatedPins[3].pin.$assign = "PA22";

GPIO7.$name                                       = "MOTOR_PIN";
GPIO7.associatedPins.create(4);
GPIO7.associatedPins[0].$name                     = "M1A";
GPIO7.associatedPins[0].pin.$assign               = "PA12";
GPIO7.associatedPins[1].$name                     = "M1B";
GPIO7.associatedPins[1].pin.$assign               = "PA13";
GPIO7.associatedPins[2].$name                     = "M2A";
GPIO7.associatedPins[2].pin.$assign               = "PA14";
GPIO7.associatedPins[3].$name                     = "M2B";
GPIO7.associatedPins[3].pin.$assignAllowConflicts = "PA16";

